
**Initializing the backend...**

```diff
+Successfully configured the backend "s3"! Terraform will automatically
+use this backend unless the backend configuration changes.
```

**Initializing provider plugins...**
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (terraform-providers/aws) 2.24.0...

```diff
+Terraform has been successfully initialized!
```
**Refreshing Terraform state in-memory prior to plan...**
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

**aws_s3_bucket.artifact_bucket: Refreshing state... [id=s3pypi-artifacts]**
**aws_s3_bucket.index_bucket: Refreshing state... [id=s3pypi-index]**

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
```diff
+    create
```

Terraform will perform the following actions:

  **# aws_sns_topic.update_topic** will be created
```diff
+    resource "aws_sns_topic" "update_topic" {
+        arn    = (known after apply)
+        id     = (known after apply)
+        name   = "s3pypi-updates"
+        policy = (known after apply)
```
    }

**Plan:** 1 to add, 0 to change, 0 to destroy.
